<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"2a8cb9a2eb9bf3efa4c393968f4064d5d56439b9a9cb132f6a2f0ab6c0dd453b","plan_job_ref":"Job Test plan target and replace #325 at https://github.com/dflook/terraform-github-actions/actions/runs/4377960090","plan_hash":"fcc7b6d7234f17631efe5799f1557f5bfd2cdfb96d6506bbe5ce595b221ce647","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "EUILu3UUAE" -> (known after apply)
  ~ foreach = "cRm1ZSrZEn" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #325](https://github.com/dflook/terraform-github-actions/actions/runs/4377960090)